particle-iot/device-os/hal/src/nRF52840/ble_hal_api.cpp
/*
 * Copyright (c) 2018 Particle Industries, Inc.  All rights reserved.
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation, either
 * version 3 of the License, or (at your option) any later version.
 *
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 *
 * You should have received a copy of the GNU Lesser General Public
 * License along with this library; if not, see <http://www.gnu.org/licenses/>.
 */

#include "logging.h"
LOG_SOURCE_CATEGORY("hal.ble")

/* Headers included from nRF5_SDK/components/softdevice/s140/headers */
#include "ble.h"
#include "ble_gap.h"
#include "ble_gatt.h"
#include "ble_gatts.h"
#include "ble_gattc.h"
#include "ble_types.h"
/* Headers included from nRF5_SDK/components/softdevice/common */
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "nrf_sdh_soc.h"

#include "app_util.h"

#include "concurrent_hal.h"
#include "static_recursive_mutex.h"
#include <mutex>

#include "ble_hal_api.h"
#include "system_error.h"

#include <string.h>


#define BLE_CONN_CFG_TAG                            1
#define BLE_OBSERVER_PRIO                           1

#define BLE_ADV_DATA_ADVERTISING                    0
#define BLE_ADV_DATA_SCAN_RESPONSE                  1

#define BLE_DISCOVERY_PROCEDURE_IDLE                0x00
#define BLE_DISCOVERY_PROCEDURE_SERVICES            0x01
#define BLE_DISCOVERY_PROCEDURE_CHARACTERISTICS     0x02
#define BLE_DISCOVERY_PROCEDURE_DESCRIPTORS         0x03


StaticRecursiveMutex s_bleMutex;

class bleLock {
    static void lock() {
        s_bleMutex.lock();
    }

    static void unlock() {
        s_bleMutex.unlock();
    }
};

typedef struct {
    uint16_t                 discStartHandle;
    uint16_t                 discEndHandle;
    hal_ble_service_t        services[BLE_MAX_SVC_COUNT];
    hal_ble_characteristic_t characteristics[BLE_MAX_CHAR_COUNT];
    hal_ble_descriptor_t     descriptors[BLE_MAX_DESC_COUNT];
    uint8_t                  discAll : 1;
    uint8_t                  count;
    uint8_t                  currIndex;
    uint8_t                  currDiscProcedure;
} HalBleDiscovery_t;

/* BLE Instance */
typedef struct {
    uint8_t  initialized  : 1;
    uint8_t  advertising  : 1;
    uint8_t  scanning     : 1;
    uint8_t  connecting   : 1;
    uint8_t  discovering  : 1;
    uint8_t  connected    : 1;
    uint8_t  indConfirmed : 1;
    int8_t   txPower;
    uint8_t  role;
    uint16_t connHandle;
    uint8_t  advHandle;
    uint8_t  connParamsUpdateAttempts;

    hal_ble_scan_parameters_t        scanParams;
    hal_ble_advertising_parameters_t advParams;
    hal_ble_connection_parameters_t  ppcp;

    uint8_t               advData[BLE_MAX_ADV_DATA_LEN];
    uint16_t              advDataLen;
    uint8_t               scanRespData[BLE_MAX_ADV_DATA_LEN];
    uint16_t              scanRespDataLen;

    os_semaphore_t        semaphore;
    os_queue_t            evtQueue;
    os_thread_t           evtThread;
    os_timer_t            connParamsUpdateTimer;

    hal_ble_connection_parameters_t effectiveConnParams;
    ble_gap_addr_t        whitelist[BLE_MAX_WHITELIST_ADDR_COUNT];
    ble_gap_addr_t const* whitelistPointer[BLE_MAX_WHITELIST_ADDR_COUNT];
    ble_event_callback_t  evtCallbacks[BLE_MAX_EVENT_CALLBACK_COUNT];

    HalBleDiscovery_t     discovery;
} HalBleInstance_t;


static HalBleInstance_t s_bleInstance = {
    .initialized  = 0,
    .advertising  = 0,
    .scanning     = 0,
    .connecting   = 0,
    .discovering  = 0,
    .connected    = 0,
    .indConfirmed = 1,
    .txPower      = 0,
    .role         = BLE_ROLE_INVALID,
    .connHandle   = BLE_INVALID_CONN_HANDLE,
    .advHandle    = BLE_GAP_ADV_SET_HANDLE_NOT_SET,
    .connParamsUpdateAttempts = 0,

    .scanParams = {
        .active        = true,
        .filter_policy = BLE_SCAN_FP_ACCEPT_ALL,
        .interval      = BLE_DEFAULT_SCANNING_INTERVAL,
        .window        = BLE_DEFAULT_SCANNING_WINDOW,
        .timeout       = BLE_DEFAULT_SCANNING_TIMEOUT
    },

    .advParams = {
        .type          = BLE_ADV_CONNECTABLE_SCANNABLE_UNDIRECRED_EVT,
        .filter_policy = BLE_ADV_FP_ANY,
        .interval      = BLE_DEFAULT_ADVERTISING_INTERVAL,
        .timeout       = BLE_DEFAULT_ADVERTISING_TIMEOUT,
        .inc_tx_power  = false
    },

    /*
     * For BLE Central, this is the initial connection parameters.
     * For BLE Peripheral, this is the Peripheral Preferred Connection Parameters.
     */
    .ppcp = {
        .min_conn_interval = BLE_DEFAULT_MIN_CONN_INTERVAL,
        .max_conn_interval = BLE_DEFAULT_MAX_CONN_INTERVAL,
        .slave_latency     = BLE_DEFAULT_SLAVE_LATENCY,
        .conn_sup_timeout  = BLE_DEFAULT_CONN_SUP_TIMEOUT
    },

    .advData = {
        0x02,
        BLE_SIG_AD_TYPE_FLAGS,
        BLE_SIG_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE
    },
    .advDataLen = 3,

    .scanRespData = { 0 },
    .scanRespDataLen = 0,

    .semaphore = NULL,
    .evtQueue  = NULL,
    .evtThread = NULL,
    .connParamsUpdateTimer = NULL,
};

static uint8_t    s_scanReportBuff[BLE_MAX_SCAN_REPORT_BUF_LEN];
static ble_data_t s_bleScanData = {
    .p_data = s_scanReportBuff,
    .len = BLE_MAX_SCAN_REPORT_BUF_LEN
};


/*
 * Valid TX Power for nRF52840:
 * -40dBm, -20dBm, -16dBm, -12dBm, -8dBm, -4dBm, 0dBm, +2dBm, +3dBm, +4dBm, +5dBm, +6dBm, +7dBm and +8dBm.
 */
static const int8_t s_validTxPower[] = {
    -20, -16, -12, -8, -4, 0, 4, 8
};


static system_error_t sysError(uint32_t error) {
    switch (error) {
        case NRF_SUCCESS:                       return SYSTEM_ERROR_NONE;
        case NRF_ERROR_SVC_HANDLER_MISSING:
        case NRF_ERROR_NOT_SUPPORTED:           return SYSTEM_ERROR_NOT_SUPPORTED;
        case NRF_ERROR_SOFTDEVICE_NOT_ENABLED:
        case NRF_ERROR_INVALID_STATE:           return SYSTEM_ERROR_INVALID_STATE;
        case NRF_ERROR_INTERNAL:                return SYSTEM_ERROR_INTERNAL;
        case NRF_ERROR_NO_MEM:                  return SYSTEM_ERROR_NO_MEMORY;
        case NRF_ERROR_NOT_FOUND:               return SYSTEM_ERROR_NOT_FOUND;
        case NRF_ERROR_INVALID_PARAM:
        case NRF_ERROR_INVALID_LENGTH:
        case NRF_ERROR_INVALID_FLAGS:
        case NRF_ERROR_INVALID_DATA:
        case NRF_ERROR_DATA_SIZE:
        case NRF_ERROR_NULL:                    return SYSTEM_ERROR_INVALID_ARGUMENT;
        case NRF_ERROR_TIMEOUT:                 return SYSTEM_ERROR_TIMEOUT;
        case NRF_ERROR_FORBIDDEN:
        case NRF_ERROR_INVALID_ADDR:            return SYSTEM_ERROR_NOT_ALLOWED;
        case NRF_ERROR_BUSY:                    return SYSTEM_ERROR_BUSY;
        case NRF_ERROR_CONN_COUNT:              return SYSTEM_ERROR_LIMIT_EXCEEDED;
        case NRF_ERROR_RESOURCES:               return SYSTEM_ERROR_ABORTED;
        default:                                return SYSTEM_ERROR_UNKNOWN;
    }
}

static int8_t roundTxPower(int8_t value) {
    uint8_t i = 0;

    for (i = 0; i < sizeof(s_validTxPower); i++) {
        if (value == s_validTxPower[i]) {
            return value;
        }
        else {
            if (value < s_validTxPower[i]) {
                return s_validTxPower[i];
            }
        }
    }

    return s_validTxPower[i - 1];
}

int setAdvData(uint8_t* data, uint16_t len, uint8_t flag) {
    bool advPending = false;

    // It is invalid to provide the same data buffers while advertising.
    if (s_bleInstance.advertising) {
        int err = ble_gap_stop_advertising();
        if (err != SYSTEM_ERROR_NONE) {
            return err;
        }
        advPending = true;
    }

    // Make sure the advertising data or scan response data is consistent.
    ble_gap_adv_data_t bleGapAdvData;
    if (flag == BLE_ADV_DATA_ADVERTISING) {
        bleGapAdvData.adv_data.p_data      = data;
        bleGapAdvData.adv_data.len         = len;
        bleGapAdvData.scan_rsp_data.p_data = s_bleInstance.scanRespData;
        bleGapAdvData.scan_rsp_data.len    = s_bleInstance.scanRespDataLen;
    }
    else {
        bleGapAdvData.adv_data.p_data      = s_bleInstance.advData;
        bleGapAdvData.adv_data.len         = s_bleInstance.advDataLen;
        bleGapAdvData.scan_rsp_data.p_data = data;
        bleGapAdvData.scan_rsp_data.len    = len;
    }

    ret_code_t ret = sd_ble_gap_adv_set_configure(&s_bleInstance.advHandle, &bleGapAdvData, NULL);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_adv_set_configure() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    if (flag == BLE_ADV_DATA_ADVERTISING) {
        memcpy(s_bleInstance.advData, data, len);
        s_bleInstance.advDataLen = len;
    }
    else {
        if (data != NULL) {
            memcpy(s_bleInstance.scanRespData, data, len);
        }
        s_bleInstance.scanRespDataLen = len;
    }

