particle-iot/device-os/hal/src/nRF52840/ble_hal_api.cpp
        s_bleInstance.connParamsUpdateAttempts++;
    }
}

static void updateConnParamsIfNeeded(void) {
    if (s_bleInstance.role == BLE_ROLE_PERIPHERAL && !isConnParamsFeeded(&s_bleInstance.effectiveConnParams)) {
        if (s_bleInstance.connParamsUpdateAttempts < BLE_CONN_PARAMS_UPDATE_ATTEMPS) {
            if (s_bleInstance.connParamsUpdateTimer != NULL) {
                if (os_timer_change(s_bleInstance.connParamsUpdateTimer, OS_TIMER_CHANGE_START, true, 0, 0, NULL)) {
                    LOG(ERROR, "os_timer_change() failed.");
                    return;
                }
            }
            LOG_DEBUG(TRACE, "Attempts to update BLE connection parameters, try: %d after %d ms",
                    s_bleInstance.connParamsUpdateAttempts, BLE_CONN_PARAMS_UPDATE_DELAY_MS);
        }
        else {
            ret_code_t ret = sd_ble_gap_disconnect(s_bleInstance.connHandle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_disconnect() failed: %u", (unsigned)ret);
                return;
            }
            LOG_DEBUG(TRACE, "Disconnecting. Update BLE connection parameters failed.");
        }
    }
}

static int addService(uint8_t type, const ble_uuid_t* uuid, uint16_t* handle) {
    ret_code_t ret;
    ret = sd_ble_gatts_service_add(type, uuid, handle);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gatts_service_add() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    LOG_DEBUG(TRACE, "Service handle: %d.", *handle);

    return SYSTEM_ERROR_NONE;
}

static int addCharacteristic(uint16_t svcHandle, const ble_uuid_t* uuid, uint8_t properties,
                             const char* description, hal_ble_characteristic_t* characteristic) {
    ret_code_t               ret;
    ble_gatts_char_md_t      charMd;
    ble_gatts_attr_md_t      valueAttrMd;
    ble_gatts_attr_md_t      userDescAttrMd;
    ble_gatts_attr_md_t      cccdAttrMd;
    ble_gatts_attr_t         charValueAttr;
    ble_gatts_char_handles_t charHandles;

    /* Characteristic metadata */
    memset(&charMd, 0, sizeof(charMd));
    fromHalCharacteristicProperties(properties, &charMd.char_props);
    // User Description Descriptor
    if (description != NULL) {
        memset(&userDescAttrMd, 0, sizeof(userDescAttrMd));
        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&userDescAttrMd.read_perm);
        BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&userDescAttrMd.write_perm);
        userDescAttrMd.vloc    = BLE_GATTS_VLOC_STACK;
        userDescAttrMd.rd_auth = 0;
        userDescAttrMd.wr_auth = 0;
        userDescAttrMd.vlen    = 0;

        charMd.p_char_user_desc        = (const uint8_t *)description;
        charMd.char_user_desc_max_size = strlen(description);
        charMd.char_user_desc_size     = strlen(description);
        charMd.p_user_desc_md          = &userDescAttrMd;
    }
    else {
        charMd.p_char_user_desc = NULL;
        charMd.p_user_desc_md   = NULL;
    }
    // Client Characteristic Configuration Descriptor
    if (charMd.char_props.notify || charMd.char_props.indicate) {
        memset(&cccdAttrMd, 0, sizeof(cccdAttrMd));
        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccdAttrMd.read_perm);
        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccdAttrMd.write_perm);
        cccdAttrMd.vloc = BLE_GATTS_VLOC_STACK;

        charMd.p_cccd_md = &cccdAttrMd;
    }
    // TODO:
    charMd.p_char_pf = NULL;
    charMd.p_sccd_md = NULL;

    /* Characteristic value attribute metadata */
    memset(&valueAttrMd, 0, sizeof(valueAttrMd));
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&valueAttrMd.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&valueAttrMd.write_perm);
    valueAttrMd.vloc    = BLE_GATTS_VLOC_STACK;
    valueAttrMd.rd_auth = 0;
    valueAttrMd.wr_auth = 0;
    valueAttrMd.vlen    = 1;

    /* Characteristic value attribute */
    memset(&charValueAttr, 0, sizeof(charValueAttr));
    charValueAttr.p_uuid    = uuid;
    charValueAttr.p_attr_md = &valueAttrMd;
    charValueAttr.init_len  = 0;
    charValueAttr.init_offs = 0;
    charValueAttr.max_len   = BLE_MAX_CHAR_VALUE_LEN;
    charValueAttr.p_value   = NULL;

    ret = sd_ble_gatts_characteristic_add(svcHandle, &charMd, &charValueAttr, &charHandles);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gatts_characteristic_add() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    characteristic->properties       = properties;
    characteristic->value_handle     = charHandles.value_handle;
    characteristic->user_desc_handle = charHandles.user_desc_handle;
    characteristic->cccd_handle      = charHandles.cccd_handle;
    characteristic->sccd_handle      = charHandles.sccd_handle;

    LOG_DEBUG(TRACE, "Characteristic value handle: %d.", charHandles.value_handle);
    LOG_DEBUG(TRACE, "Characteristic cccd handle: %d.", charHandles.cccd_handle);

    return SYSTEM_ERROR_NONE;
}

static int writeAttribute(uint16_t connHandle, uint16_t attrHandle, uint8_t* data, uint16_t len, bool response) {
    ble_gattc_write_params_t writeParams;

    if (response) {
        writeParams.write_op = BLE_GATT_OP_WRITE_REQ;
    }
    else {
        writeParams.write_op = BLE_GATT_OP_WRITE_CMD;
    }
    writeParams.flags    = BLE_GATT_EXEC_WRITE_FLAG_PREPARED_WRITE;
    writeParams.handle   = attrHandle;
    writeParams.offset   = 0;
    writeParams.len      = len;
    writeParams.p_value  = data;

    ret_code_t ret = sd_ble_gattc_write(connHandle, &writeParams);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gattc_write() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    return SYSTEM_ERROR_NONE;
}

static void dispatchBleEvent(hal_ble_event_t* evt) {
    for (uint8_t i = 0; i < BLE_MAX_EVENT_CALLBACK_COUNT; i++) {
        if (s_bleInstance.evtCallbacks[i] != NULL) {
            s_bleInstance.evtCallbacks[i](evt);
        }
    }
}

static void isrProcessBleEvent(const ble_evt_t* event, void* context) {
    ret_code_t      ret;
    hal_ble_event_t bleEvt;

