particle-iot/device-os/hal/src/nRF52840/ble_hal_api.cpp
            bool terminate = true;
            if ( (event->evt.gattc_evt.gatt_status == BLE_GATT_STATUS_SUCCESS)
              && (s_bleInstance.discovery.currDiscProcedure == BLE_DISCOVERY_PROCEDURE_DESCRIPTORS) ) {
                for (uint8_t i = 0; i < descCount; i++) {
                    // It will report all attributes with 16-bits UUID, filter descriptors.
                    switch (event->evt.gattc_evt.params.desc_disc_rsp.descs[i].uuid.uuid) {
                        case BLE_SIG_UUID_CHAR_EXTENDED_PROPERTIES_DESC:
                        case BLE_SIG_UUID_CHAR_USER_DESCRIPTION_DESC:
                        case BLE_SIG_UUID_CLIENT_CHAR_CONFIG_DESC:
                        case BLE_SIG_UUID_SERVER_CHAR_CONFIG_DESC:
                        case BLE_SIG_UUID_CHAR_PRESENT_FORMAT_DESC:
                        case BLE_SIG_UUID_CHAR_AGGREGATE_FORMAT: {
                            s_bleInstance.discovery.descriptors[s_bleInstance.discovery.count].handle = event->evt.gattc_evt.params.desc_disc_rsp.descs[i].handle;
                            toHalUuid(&event->evt.gattc_evt.params.desc_disc_rsp.descs[i].uuid, &s_bleInstance.discovery.descriptors[s_bleInstance.discovery.count].uuid);
                            s_bleInstance.discovery.count++;
                        }
                        default: break;
                    }
                    if (s_bleInstance.discovery.count >= BLE_MAX_DESC_COUNT) {
                        break;
                    }
                }

                uint16_t currEndHandle = event->evt.gattc_evt.params.desc_disc_rsp.descs[descCount-1].handle;
                if ( (currEndHandle < s_bleInstance.discovery.discEndHandle)
                  && (s_bleInstance.discovery.count < BLE_MAX_DESC_COUNT) ) {
                    ble_gattc_handle_range_t handleRange;
                    handleRange.start_handle = currEndHandle + 1;
                    handleRange.end_handle   = s_bleInstance.discovery.discEndHandle;
                    ret = sd_ble_gattc_descriptors_discover(event->evt.gattc_evt.conn_handle, &handleRange);
                    if (ret != NRF_SUCCESS) {
                        LOG(ERROR, "sd_ble_gattc_descriptors_discover() failed: %u", (unsigned)ret);
                    }
                    else {
                        terminate = false;
                    }
                }
            }
            else {
                LOG(ERROR, "BLE characteristic discovery failed: %d, handle: %d.", event->evt.gattc_evt.gatt_status, event->evt.gattc_evt.error_handle);
            }

            if (terminate) {
                bleEvt.evt_type               = BLE_EVT_TYPE_DISCOVERY;
                bleEvt.disc_event.evt_id      = BLE_DISC_EVT_ID_DESC_DISCOVERED;
                bleEvt.disc_event.conn_handle = event->evt.gattc_evt.conn_handle;
                bleEvt.disc_event.descriptors = s_bleInstance.discovery.descriptors;
                bleEvt.disc_event.count       = s_bleInstance.discovery.count;
                if (os_queue_put(s_bleInstance.evtQueue, &bleEvt, 0, NULL)) {
                    LOG(ERROR, "os_queue_put() failed.");
                    s_bleInstance.discovery.currDiscProcedure = BLE_DISCOVERY_PROCEDURE_IDLE;
                    s_bleInstance.discovering = false;
                }
            }
        } break;

        case BLE_GATTC_EVT_READ_RSP: {
            LOG_DEBUG(TRACE, "BLE GATT Client event: read response.");

            if (event->evt.gattc_evt.gatt_status == BLE_GATT_STATUS_SUCCESS) {
                if (s_bleInstance.discovering) {
                    if ( (s_bleInstance.discovery.currDiscProcedure == BLE_DISCOVERY_PROCEDURE_SERVICES)
                      && (event->evt.gattc_evt.params.read_rsp.handle == s_bleInstance.discovery.services[s_bleInstance.discovery.currIndex].start_handle) ) {
                        s_bleInstance.discovery.services[s_bleInstance.discovery.currIndex].uuid.type = BLE_UUID_TYPE_128BIT;
                        memcpy(s_bleInstance.discovery.services[s_bleInstance.discovery.currIndex].uuid.uuid128, event->evt.gattc_evt.params.read_rsp.data, BLE_SIG_UUID_128BIT_LEN);
                        os_semaphore_give(s_bleInstance.semaphore, false);
                    }
                    else if ( (s_bleInstance.discovery.currDiscProcedure == BLE_DISCOVERY_PROCEDURE_CHARACTERISTICS)
                           && (event->evt.gattc_evt.params.read_rsp.handle == s_bleInstance.discovery.characteristics[s_bleInstance.discovery.currIndex].decl_handle) ) {
                        s_bleInstance.discovery.characteristics[s_bleInstance.discovery.currIndex].uuid.type = BLE_UUID_TYPE_128BIT;
                        // The offset of Characteristic UUID in the Characteristic declaration attribute is 3.
                        memcpy(s_bleInstance.discovery.characteristics[s_bleInstance.discovery.currIndex].uuid.uuid128, &event->evt.gattc_evt.params.read_rsp.data[3], BLE_SIG_UUID_128BIT_LEN);
                        os_semaphore_give(s_bleInstance.semaphore, false);
                    }
                }
                else {
                    bleEvt.evt_type               = BLE_EVT_TYPE_DATA;
                    bleEvt.data_event.evt_id      = BLE_DATA_EVT_ID_READ;
                    bleEvt.data_event.conn_handle = event->evt.gattc_evt.conn_handle;
                    bleEvt.data_event.attr_handle = event->evt.gattc_evt.params.read_rsp.handle;
                    bleEvt.data_event.data_len    = event->evt.gattc_evt.params.read_rsp.len;
                    memcpy(bleEvt.data_event.data, event->evt.gattc_evt.params.read_rsp.data, bleEvt.data_event.data_len);
                    if (os_queue_put(s_bleInstance.evtQueue, &bleEvt, 0, NULL)) {
                        LOG(ERROR, "os_queue_put() failed.");
                    }
                }
            }
            else {
                LOG(ERROR, "BLE read characteristic failed: %d, handle: %d.", event->evt.gattc_evt.gatt_status, event->evt.gattc_evt.error_handle);
            }
        } break;

        case BLE_GATTC_EVT_WRITE_RSP: {
            LOG_DEBUG(TRACE, "BLE GATT Client event: write with response completed.");
        } break;

        case BLE_GATTC_EVT_WRITE_CMD_TX_COMPLETE: {
            LOG_DEBUG(TRACE, "BLE GATT Client event: write without response completed.");
        } break;

        case BLE_GATTC_EVT_HVX: {
            LOG_DEBUG(TRACE, "BLE GATT Client event: data received. conn_handle: %d, attr_handle: %d, len: %d, type: %d",
                    event->evt.gattc_evt.conn_handle, event->evt.gattc_evt.params.hvx.handle,
                    event->evt.gattc_evt.params.hvx.len, event->evt.gattc_evt.params.hvx.type);

            if (event->evt.gattc_evt.params.hvx.type == BLE_GATT_HVX_INDICATION) {
                ret = sd_ble_gattc_hv_confirm(event->evt.gattc_evt.conn_handle, event->evt.gattc_evt.params.hvx.handle);
                if (ret != NRF_SUCCESS) {
                    LOG(ERROR, "sd_ble_gattc_hv_confirm() failed: %u", (unsigned)ret);
                }
            }

            bleEvt.evt_type               = BLE_EVT_TYPE_DATA;
            bleEvt.data_event.evt_id      = BLE_DATA_EVT_ID_NOTIFY;
            bleEvt.data_event.conn_handle = event->evt.gattc_evt.conn_handle;
            bleEvt.data_event.attr_handle = event->evt.gattc_evt.params.hvx.handle;
            bleEvt.data_event.data_len    = event->evt.gattc_evt.params.hvx.len;
            memcpy(bleEvt.data_event.data, event->evt.gattc_evt.params.hvx.data, bleEvt.data_event.data_len);
            if (os_queue_put(s_bleInstance.evtQueue, &bleEvt, 0, NULL)) {
                LOG(ERROR, "os_queue_put() failed.");
            }
        } break;

        case BLE_GATTC_EVT_TIMEOUT: {
            LOG_DEBUG(TRACE, "BLE GATT Client event: timeout, conn handle: %d, source: %d",
                    event->evt.gattc_evt.conn_handle, event->evt.gattc_evt.params.timeout.src);

            // Disconnect on GATT Client timeout event.
            ret = sd_ble_gap_disconnect(event->evt.gattc_evt.conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_disconnect() failed: %u", (unsigned)ret);
            }
        } break;

        case BLE_GATTS_EVT_SYS_ATTR_MISSING: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: system attribute is missing.");

