particle-iot/device-os/hal/src/nRF52840/ble_hal_api.cpp
            // No persistent system attributes
            const uint32_t ret = sd_ble_gatts_sys_attr_set(event->evt.gatts_evt.conn_handle, nullptr, 0, 0);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gatts_sys_attr_set() failed: %u", (unsigned)ret);
            }
        } break;

        case BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: exchange ATT MTU request.");
            LOG_DEBUG(TRACE, "Effective Client RX MTU: %d.", event->evt.gatts_evt.params.exchange_mtu_request.client_rx_mtu);

            ret = sd_ble_gatts_exchange_mtu_reply(event->evt.gatts_evt.conn_handle, NRF_SDH_BLE_GATT_MAX_MTU_SIZE);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gatts_exchange_mtu_reply() failed: %u", (unsigned)ret);
            }

            LOG_DEBUG(TRACE, "Reply with Server RX MTU: %d.", NRF_SDH_BLE_GATT_MAX_MTU_SIZE);
        } break;

        case BLE_GATTS_EVT_WRITE: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: write characteristic.");

            bleEvt.evt_type               = BLE_EVT_TYPE_DATA;
            bleEvt.data_event.evt_id      = BLE_DATA_EVT_ID_WRITE;
            bleEvt.data_event.conn_handle = event->evt.gatts_evt.conn_handle;
            bleEvt.data_event.attr_handle = event->evt.gatts_evt.params.write.handle;
            bleEvt.data_event.data_len    = event->evt.gatts_evt.params.write.len;
            memcpy(bleEvt.data_event.data, event->evt.gatts_evt.params.write.data, bleEvt.data_event.data_len);
            if (os_queue_put(s_bleInstance.evtQueue, &bleEvt, 0, NULL)) {
                LOG(ERROR, "os_queue_put() failed.");
            }
        } break;

        case BLE_GATTS_EVT_HVN_TX_COMPLETE: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: notification sent.");
        } break;

        case BLE_GATTS_EVT_HVC: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: indication confirmed.");
            s_bleInstance.indConfirmed = true;
        } break;

        case BLE_GATTS_EVT_TIMEOUT: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: timeout, source: %d.", event->evt.gatts_evt.params.timeout.src);

            // Disconnect on GATT Server timeout event.
            ret = sd_ble_gap_disconnect(event->evt.gatts_evt.conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_disconnect() failed: %u", (unsigned)ret);
            }
        } break;

        default: {
            LOG_DEBUG(TRACE, "Unhandled BLE event: %u", (unsigned)event->header.evt_id);
        } break;
    }
}

static os_thread_return_t handleBleEventThread(void* param) {
    while (1) {
        hal_ble_event_t bleEvent;
        if (!os_queue_take(s_bleInstance.evtQueue, &bleEvent, CONCURRENT_WAIT_FOREVER, NULL)) {
            // Try retrieving 128-bits service or characteristic UUID before dispatching this event.
            if (bleEvent.evt_type == BLE_EVT_TYPE_DISCOVERY) {
                if (bleEvent.disc_event.evt_id == BLE_DISC_EVT_ID_SVC_DISCOVERED) {
                    for (uint8_t i = 0; i < bleEvent.disc_event.count; i++) {
                        if (bleEvent.disc_event.services[i].uuid.type == BLE_UUID_TYPE_128BIT_SHORTED) {
                            ret_code_t ret = sd_ble_gattc_read(bleEvent.disc_event.conn_handle, bleEvent.disc_event.services[i].start_handle, 0);
                            if (ret != NRF_SUCCESS) {
                                LOG(ERROR, "sd_ble_gattc_read() failed: %u", (unsigned)ret);
                                break;
                            }
                            s_bleInstance.discovery.currIndex = i;
                            if (os_semaphore_take(s_bleInstance.semaphore, 2000, false)) {
                                LOG(ERROR, "os_semaphore_take() timeout.");
                                break;
                            }
                        }
                    }
                }
                else if (bleEvent.disc_event.evt_id == BLE_DISC_EVT_ID_CHAR_DISCOVERED) {
                    for (uint8_t i = 0; i < bleEvent.disc_event.count; i++) {
                        if (bleEvent.disc_event.characteristics[i].uuid.type == BLE_UUID_TYPE_128BIT_SHORTED) {
                            ret_code_t ret = sd_ble_gattc_read(bleEvent.disc_event.conn_handle, bleEvent.disc_event.characteristics[i].decl_handle, 0);
                            if (ret != NRF_SUCCESS) {
                                LOG(ERROR, "sd_ble_gattc_read() failed: %u", (unsigned)ret);
                                break;
                            }
                            s_bleInstance.discovery.currIndex = i;
                            if (os_semaphore_take(s_bleInstance.semaphore, 2000, false)) {
                                LOG(ERROR, "os_semaphore_take() timeout.");
                                break;
                            }
                        }
                    }
                }
                s_bleInstance.discovery.currDiscProcedure = BLE_DISCOVERY_PROCEDURE_IDLE;
                s_bleInstance.discovering = false;
            }

            dispatchBleEvent(&bleEvent);
        }
        else {
            LOG(ERROR, "BLE event thread exited.");
            break;
        }
    }

    os_thread_exit(s_bleInstance.evtThread);
}


/**********************************************
 * Particle BLE APIs
 */
bool ble_stack_is_initialized(void) {
    return s_bleInstance.initialized;
}

int ble_stack_init(void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());

    /* The SoftDevice has been enabled in core_hal.c */
    LOG_DEBUG(TRACE, "ble_stack_init().");

    if (!s_bleInstance.initialized) {
        // Configure the BLE stack using the default settings.
        // Fetch the start address of the application RAM.
        uint32_t ramStart = 0;
        ret_code_t ret = nrf_sdh_ble_default_cfg_set(BLE_CONN_CFG_TAG, &ramStart);
        if (ret != NRF_SUCCESS) {
            LOG(ERROR, "nrf_sdh_ble_default_cfg_set() failed: %u", (unsigned)ret);
            return sysError(ret);
        }
        LOG_DEBUG(TRACE, "RAM start: 0x%08x", (unsigned)ramStart);

