particle-iot/device-os/hal/src/nRF52840/ble_hal_api.cpp
    if (advPending) {
        advPending = false;
        return ble_gap_start_advertising();
    }

    memcpy(&s_bleInstance.advParams, adv_params, sizeof(hal_ble_advertising_parameters_t));

    return sysError(ret);
}

int ble_gap_set_advertising_data(uint8_t* data, uint16_t len) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_set_advertising_data().");

    if ((data == NULL) || (len < 3)) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    return setAdvData(data, len, BLE_ADV_DATA_ADVERTISING);
}

int ble_gap_set_scan_response_data(uint8_t* data, uint16_t len) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_set_scan_response_data().");

    if (data == NULL) {
        len = 0;
    }

    return setAdvData(data, len, BLE_ADV_DATA_SCAN_RESPONSE);
}

int ble_gap_start_advertising(void) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_start_advertising().");

    if (s_bleInstance.advertising) {
        return SYSTEM_ERROR_NONE;
    }

    ret_code_t ret = sd_ble_gap_adv_start(s_bleInstance.advHandle, BLE_CONN_CFG_TAG);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_adv_start() failed: %u", (unsigned)ret);
        return sysError(ret);
    }
    else {
        s_bleInstance.advertising = true;
        return SYSTEM_ERROR_NONE;
    }
}

int ble_gap_stop_advertising(void) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_stop_advertising().");

    if (!s_bleInstance.advertising) {
        return SYSTEM_ERROR_NONE;
    }

    ret_code_t ret = sd_ble_gap_adv_stop(s_bleInstance.advHandle);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_adv_stop() failed: %u", (unsigned)ret);
        return sysError(ret);
    }
    else {
        s_bleInstance.advertising = false;
        return SYSTEM_ERROR_NONE;
    }
}

bool ble_gap_is_advertising(void) {
    return s_bleInstance.advertising;
}

int ble_gap_set_scan_parameters(hal_ble_scan_parameters_t* scan_params) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_set_scan_parameters().");

    if (scan_params == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    if (scan_params->interval < BLE_GAP_SCAN_INTERVAL_MIN) {
        scan_params->interval = BLE_GAP_SCAN_INTERVAL_MIN;
    }
    if (scan_params->interval > BLE_GAP_SCAN_INTERVAL_MAX) {
        scan_params->interval = BLE_GAP_SCAN_INTERVAL_MAX;
    }
    if (scan_params->window < BLE_GAP_SCAN_WINDOW_MIN) {
        scan_params->window = BLE_GAP_SCAN_WINDOW_MIN;
    }
    if (scan_params->window > BLE_GAP_SCAN_WINDOW_MAX) {
        scan_params->window = BLE_GAP_SCAN_WINDOW_MAX;
    }

    memcpy(&s_bleInstance.scanParams, scan_params, sizeof(hal_ble_scan_parameters_t));

    return SYSTEM_ERROR_NONE;
}

int ble_gap_start_scan(void) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_start_scan().");

    sd_ble_gap_scan_stop();
    s_bleInstance.scanning = false;

    ble_gap_scan_params_t bleGapScanParams;
    fromHalScanParams(&s_bleInstance.scanParams, &bleGapScanParams);

    LOG_DEBUG(TRACE, "| interval(ms)   window(ms)   timeout(ms) |");
    LOG_DEBUG(TRACE, "  %.3f        %.3f      %d",
            bleGapScanParams.interval*0.625,
            bleGapScanParams.window*0.625,
            bleGapScanParams.timeout*10);

    ret_code_t ret = sd_ble_gap_scan_start(&bleGapScanParams, &s_bleScanData);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_scan_start() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    s_bleInstance.scanning = true;

    return SYSTEM_ERROR_NONE;
}

bool ble_gap_is_scanning(void) {
    return s_bleInstance.scanning;
}

int ble_gap_stop_scan(void) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_stop_scan().");

    ret_code_t ret = sd_ble_gap_scan_stop();
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_scan_start() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    s_bleInstance.scanning = false;

    return SYSTEM_ERROR_NONE;
}

int ble_gap_connect(hal_ble_address_t* address) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_connect().");

    s_bleInstance.scanning = false;

    ble_gap_addr_t devAddr;
    memset(&devAddr, 0x00, sizeof(ble_gap_addr_t));
    devAddr.addr_type = address->addr_type;
    memcpy(devAddr.addr, address->addr, BLE_SIG_ADDR_LEN);

    ble_gap_scan_params_t bleGapScanParams;
    fromHalScanParams(&s_bleInstance.scanParams, &bleGapScanParams);

    ble_gap_conn_params_t connParams;
    fromHalConnParams(&s_bleInstance.ppcp, &connParams);

    ret_code_t ret = sd_ble_gap_connect(&devAddr, &bleGapScanParams, &connParams, BLE_CONN_CFG_TAG);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_connect() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    s_bleInstance.connecting = true;

    return 0;
}

bool ble_gap_is_connecting(void) {
    return s_bleInstance.connecting;
}

bool ble_gap_is_connected(void) {
    return s_bleInstance.connected;
}

int ble_gap_connect_cancel(void) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_connect_cancel().");

    if (s_bleInstance.connecting) {
        ret_code_t ret = sd_ble_gap_connect_cancel();
        if (ret != NRF_SUCCESS) {
            LOG(ERROR, "sd_ble_gap_connect_cancel() failed: %u", (unsigned)ret);
            return sysError(ret);
        }

        s_bleInstance.connecting = false;
    }

    return 0;
}

int ble_gap_disconnect(uint16_t conn_handle) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_disconnect().");

    if (!s_bleInstance.connected) {
        return SYSTEM_ERROR_INVALID_STATE;
    }
    else if (s_bleInstance.role == BLE_ROLE_PERIPHERAL) {
        conn_handle = s_bleInstance.connHandle;
    }
    else if (conn_handle == BLE_INVALID_CONN_HANDLE) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    ret_code_t ret = sd_ble_gap_disconnect(conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_disconnect() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    return SYSTEM_ERROR_NONE;
}

int ble_gap_update_connection_params(uint16_t conn_handle, hal_ble_connection_parameters_t* conn_params) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_update_connection_params().");

    ret_code_t ret;

