particle-iot/device-os/hal/src/nRF52840/ble_hal_api.cpp
    if (conn_handle == BLE_INVALID_CONN_HANDLE) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    if (conn_params == NULL) {
        // For Central role, this will reject the connection parameter update request.
        // For Peripheral role, this will use the PPCP characteristic value as the connection parameters,
        // and send the request to Central.
        ret = sd_ble_gap_conn_param_update(conn_handle, NULL);
    }
    else {
        // For Central role, this will initiate the connection parameter update procedure.
        // For Peripheral role, this will use the passed in parameters and send the request to central.
        ble_gap_conn_params_t connParams;
        connParams.min_conn_interval = conn_params->min_conn_interval;
        connParams.max_conn_interval = conn_params->max_conn_interval;
        connParams.slave_latency     = conn_params->slave_latency;
        connParams.conn_sup_timeout  = conn_params->conn_sup_timeout;
        ret = sd_ble_gap_conn_param_update(conn_handle, &connParams);
    }

    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_conn_param_update() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    return SYSTEM_ERROR_NONE;
}

int ble_gap_get_rssi(uint16_t conn_handle) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_get_rssi().");

    return 0;
}


/**********************************************
 * BLE GATT Server APIs
 */
int ble_gatt_server_add_service_uuid128(uint8_t type, const uint8_t* uuid128, uint16_t* handle) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gatt_server_add_service_uuid128().");

    ble_uuid_t     svcUuid;
    hal_ble_uuid_t halUuid;

    if (uuid128 == NULL || handle == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    halUuid.type = BLE_UUID_TYPE_128BIT;
    memcpy(halUuid.uuid128, uuid128, BLE_SIG_UUID_128BIT_LEN);

    int ret = fromHalUuid(&halUuid, &svcUuid);
    if (ret == SYSTEM_ERROR_NONE) {
        ret = addService(type, &svcUuid, handle);
    }

    return ret;
}

int ble_gatt_server_add_service_uuid16(uint8_t type, uint16_t uuid16, uint16_t* handle) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gatt_server_add_service_uuid16().");

    if (handle == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    ble_uuid_t svcUuid;
    svcUuid.type = BLE_UUID_TYPE_BLE;
    svcUuid.uuid = uuid16;

    return addService(type, &svcUuid, handle);
}

int ble_gatt_server_add_characteristic_uuid128(uint16_t service_handle, const uint8_t *uuid128, uint8_t properties,
                                               const char* description, hal_ble_characteristic_t* characteristic) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gatt_server_add_characteristic_uuid128().");

    ble_uuid_t     charUuid;
    hal_ble_uuid_t halUuid;

    if (uuid128 == NULL || characteristic == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    halUuid.type = BLE_UUID_TYPE_128BIT;
    memcpy(halUuid.uuid128, uuid128, BLE_SIG_UUID_128BIT_LEN);

    int ret = fromHalUuid(&halUuid, &charUuid);
    if (ret == SYSTEM_ERROR_NONE) {
        ret = addCharacteristic(service_handle, &charUuid, properties, description, characteristic);
        if (SYSTEM_ERROR_NONE == ret) {
            characteristic->uuid.type = BLE_UUID_TYPE_128BIT;
            memcpy(characteristic->uuid.uuid128, uuid128, BLE_SIG_UUID_128BIT_LEN);
        }
    }

    return ret;
}

int ble_gatt_server_add_characteristic_uuid16(uint16_t service_handle, uint16_t uuid16, uint8_t properties,
                                              const char* description, hal_ble_characteristic_t* characteristic) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gatt_server_add_characteristic_uuid16().");

    if (characteristic == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    ble_uuid_t charUuid;
    charUuid.type = BLE_UUID_TYPE_BLE;
    charUuid.uuid = uuid16;

    int error = addCharacteristic(service_handle, &charUuid, properties, description, characteristic);
    if (SYSTEM_ERROR_NONE == error) {
        characteristic->uuid.type   = BLE_UUID_TYPE_16BIT;
        characteristic->uuid.uuid16 = uuid16;
    }

    return error;
}

int ble_gatt_server_add_characteristic_descriptor(uint8_t* descriptor, uint16_t len, hal_ble_characteristic_t* characteristic) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gatt_server_add_characteristic_descriptor().");

    if (characteristic == NULL || descriptor == NULL || characteristic->value_handle == 0) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    ret_code_t ret;
    ble_gatts_attr_t descAttr;
    ble_gatts_attr_md_t descAttrMd;
    ble_uuid_t descUuid;

    if (characteristic->uuid.type == BLE_UUID_TYPE_16BIT) {
        descUuid.type = BLE_UUID_TYPE_BLE;
        descUuid.uuid = characteristic->uuid.uuid16;
    }
    else {
        ret = sd_ble_uuid_decode(BLE_SIG_UUID_128BIT_LEN, characteristic->uuid.uuid128, &descUuid);
        if (ret != NRF_SUCCESS) {
            LOG(ERROR, "sd_ble_uuid_decode() failed: %u", (unsigned)ret);
            return sysError(ret);
        }
    }

    memset(&descAttrMd, 0, sizeof(descAttrMd));
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&descAttrMd.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&descAttrMd.write_perm);
    descAttrMd.vloc = BLE_GATTS_VLOC_STACK;
    descAttrMd.rd_auth = 0;
    descAttrMd.wr_auth = 0;
    descAttrMd.vlen    = 0;

    memset(&descAttr, 0, sizeof(descAttr));
    descAttr.p_uuid    = &descUuid;
    descAttr.p_attr_md = &descAttrMd;
    descAttr.init_len  = len;
    descAttr.init_offs = 0;
    descAttr.max_len   = len;
    descAttr.p_value   = descriptor;

    // FIXME: check the descriptor to be added
    ret = sd_ble_gatts_descriptor_add(characteristic->value_handle, &descAttr, &characteristic->user_desc_handle);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gatts_descriptor_add() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    return SYSTEM_ERROR_NONE;
}

int ble_gatt_server_set_characteristic_value(uint16_t value_handle, uint8_t* data, uint16_t len) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gatt_server_set_characteristic_value().");

    if (value_handle == BLE_INVALID_ATTR_HANDLE || data == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

