particle-iot/device-os/hal/src/nRF52840/ble_hal_api.cpp
    if (conn_handle == BLE_INVALID_CONN_HANDLE) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    ble_gattc_handle_range_t handleRange;
    handleRange.start_handle = start_handle;
    handleRange.end_handle   = end_handle;

    ret_code_t ret = sd_ble_gattc_characteristics_discover(conn_handle, &handleRange);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gattc_characteristics_discover() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    memset(&s_bleInstance.discovery, 0x00, sizeof(s_bleInstance.discovery));
    s_bleInstance.discovery.currDiscProcedure = BLE_DISCOVERY_PROCEDURE_CHARACTERISTICS;
    s_bleInstance.discovery.discStartHandle = start_handle;
    s_bleInstance.discovery.discEndHandle = end_handle;
    s_bleInstance.discovering = true;

    return SYSTEM_ERROR_NONE;
}

int ble_gatt_client_discover_descriptors(uint16_t conn_handle, uint16_t start_handle, uint16_t end_handle) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gatt_client_discover_descriptors().");

    if (conn_handle == BLE_INVALID_CONN_HANDLE) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    ble_gattc_handle_range_t handleRange;
    handleRange.start_handle = start_handle;
    handleRange.end_handle   = end_handle;

    ret_code_t ret = sd_ble_gattc_descriptors_discover(conn_handle, &handleRange);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gattc_descriptors_discover() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    memset(&s_bleInstance.discovery, 0x00, sizeof(s_bleInstance.discovery));
    s_bleInstance.discovery.currDiscProcedure = BLE_DISCOVERY_PROCEDURE_DESCRIPTORS;
    s_bleInstance.discovery.discStartHandle = start_handle;
    s_bleInstance.discovery.discEndHandle = end_handle;
    s_bleInstance.discovering = true;

    return SYSTEM_ERROR_NONE;
}

bool ble_gatt_client_is_discovering(void) {
    return s_bleInstance.discovering;
}

int ble_gatt_client_configure_cccd(uint16_t conn_handle, uint16_t cccd_handle, uint8_t cccd_value) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gatt_client_configure_cccd().");

    if (conn_handle == BLE_CONN_HANDLE_INVALID || cccd_handle == BLE_INVALID_ATTR_HANDLE) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if (cccd_value > BLE_SIG_CCCD_VAL_INDICATION) {
        return SYSTEM_ERROR_NOT_SUPPORTED;
    }

    uint8_t buf[2] = {0x00, 0x00};
    buf[0] = cccd_value;

    return writeAttribute(conn_handle, cccd_handle, buf, 2, true);
}

int ble_gatt_client_write_with_response(uint16_t conn_handle, uint16_t value_handle, uint8_t* data, uint16_t len) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gatt_client_write_with_response().");

    if (conn_handle == BLE_CONN_HANDLE_INVALID || value_handle == BLE_INVALID_ATTR_HANDLE) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    return writeAttribute(conn_handle, value_handle, data, len, true);
}

int ble_gatt_client_write_without_response(uint16_t conn_handle, uint16_t value_handle, uint8_t* data, uint16_t len) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gatt_client_write_without_response().");

    if (conn_handle == BLE_CONN_HANDLE_INVALID || value_handle == BLE_INVALID_ATTR_HANDLE) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    return writeAttribute(conn_handle, value_handle, data, len, false);
}

int ble_gatt_client_read(uint16_t conn_handle, uint16_t value_handle) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gatt_client_read().");

    if (conn_handle == BLE_CONN_HANDLE_INVALID || value_handle == BLE_INVALID_ATTR_HANDLE) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    ret_code_t ret = sd_ble_gattc_read(conn_handle, value_handle, 0);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gattc_read() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    return SYSTEM_ERROR_NONE;
}


